app/controllers/gossips_controller.rb

  def create
  	@gossip = Gossip.new(title: params[:title], content: params[:content])
  @gossip.user = current_user
  if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "k"], ["content", "k"], ["created_at", "2019-02-06 10:01:42.681968"], ["updated_at", "2019-02-06 10:01:42.681968"]]