app/controllers/users_controller.rb

SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "email", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
      puts "$"*80

      @user = User.new(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password])
      @user.city_id = City.all.sample.id
      if @user.save